IRP/src/AccumulationRegisters/R2021B_CustomersTransactions/R2021B_CustomersTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R2021B_CustomersTransactions</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CustomersAdvancesClosing</name>
  <type>
   <types>DocumentRef.CustomersAdvancesClosing</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DefinedType.typeArTransactionBasises</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Project</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R1021B_VendorsTransactions/R1021B_VendorsTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R1021B_VendorsTransactions</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>VendorsAdvancesClosing</name>
  <type>
   <types>DocumentRef.VendorsAdvancesClosing</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DefinedType.typeApTransactionBasises</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Project</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Documents/DebitNote/DebitNote.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>DebitNote</name>
 <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
 <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R2022B_CustomersPaymentPlanning</registerRecords>
 <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
 <registerRecords>AccumulationRegister.B1040B_AgingKey</registerRecords>
 <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
 <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.R2040B_TaxesIncoming</registerRecords>
 <registerRecords>AccumulationRegister.R5012B_VendorsAging</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>Manager</name>
  <type>
   <types>CatalogRef.Users</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Transactions</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Partner</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>AdditionalAnalytic</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalName</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalNameContract</name>
   <type>
    <types>CatalogRef.LegalNameContracts</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisDocument</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
    <types>DocumentRef.PurchaseReturn</types>
    <types>DocumentRef.OpeningEntry</types>
    <types>DocumentRef.SalesReturn</types>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Detail</name>
   <type>
    <types>DefinedType.typeDescription</types>
   </type>
  </attributes>
  <attributes>
   <name>VatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>NetAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxExemptionReason</name>
   <type>
    <types>CatalogRef.TaxExemptionReasons</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/CreditNote/CreditNote.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>CreditNote</name>
 <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
 <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
 <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
 <registerRecords>AccumulationRegister.B1040B_AgingKey</registerRecords>
 <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R1040B_TaxesOutgoing</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
 <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R5012B_VendorsAging</registerRecords>
 <registerRecords>AccumulationRegister.R1022B_VendorsPaymentPlanning</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>Manager</name>
  <type>
   <types>CatalogRef.Users</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Transactions</name>
  <attributes>
   <name>Partner</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>AdditionalAnalytic</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalName</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalNameContract</name>
   <type>
    <types>CatalogRef.LegalNameContracts</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisDocument</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
    <types>DocumentRef.PurchaseReturn</types>
    <types>DocumentRef.OpeningEntry</types>
    <types>DocumentRef.SalesReturn</types>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Detail</name>
   <type>
    <types>DefinedType.typeDescription</types>
   </type>
  </attributes>
  <attributes>
   <name>VatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>NetAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxExemptionReason</name>
   <type>
    <types>CatalogRef.TaxExemptionReasons</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/CommonModules/JorDocumentsClient/Module.bsl
Procedure BasisDocumentStartChoice(Object, Form, Item, CurrentData, Parameters) Export
	TransferParameters = New Structure();
	TransferParameters.Insert("Unmarked", True);
	TransferParameters.Insert("Posted", True);
	If Parameters.Property("Filter") Then
		For Each KeyValue In Parameters.Filter Do
			TransferParameters.Insert(KeyValue.Key, KeyValue.Value);
		EndDo;
	EndIf;
	ArrayOfFilterFromCurrentData = StrSplit(Parameters.FilterFromCurrentData, ",");
	For Each ItemOfFilterFromCurrentData In ArrayOfFilterFromCurrentData Do
		If ValueIsFilled(CurrentData[TrimAll(ItemOfFilterFromCurrentData)]) Then
			TransferParameters.Insert(ItemOfFilterFromCurrentData, CurrentData[TrimAll(ItemOfFilterFromCurrentData)]);
		EndIf;
	EndDo;
	OpeningEntryTableName1 = Undefined;
	If Parameters.Property("OpeningEntryTableName1") Then
		OpeningEntryTableName1 = Parameters.OpeningEntryTableName1;
	EndIf;
	
	OpeningEntryTableName2 = Undefined;
	If Parameters.Property("OpeningEntryTableName2") Then
		OpeningEntryTableName2 = Parameters.OpeningEntryTableName2;
	EndIf;
	
	DebitNoteTableName = Undefined;
	If Parameters.Property("DebitNoteTableName") Then
		DebitNoteTableName = Parameters.DebitNoteTableName;
	EndIf;

	CreditNoteTableName = Undefined;
	If Parameters.Property("CreditNoteTableName") Then
		CreditNoteTableName = Parameters.CreditNoteTableName;
	EndIf;
	
	FilterStructure = CreateFilterByParameters(Parameters.Ref,
		TransferParameters, 
		Parameters.TableName, 
		OpeningEntryTableName1, 
		OpeningEntryTableName2,
		DebitNoteTableName,
		CreditNoteTableName);
	FormParameters = New Structure("CustomFilter", FilterStructure);
	
	OpenForm("DocumentJournal." + Parameters.TableName + ".Form.ChoiceForm",
		FormParameters,
		Item,
		Form.UUID,
		,
		Form.URL,
		Parameters.Notify,
		FormWindowOpeningMode.LockOwnerWindow);
EndProcedure

Function CreateFilterByParameters(Ref, Parameters, TableName, 
                                  OpeningEntryTableName1 = Undefined, 
                                  OpeningEntryTableName2 = Undefined,
                                  DebitNoteTableName = Undefined,
                                  CreditNoteTableName)
	QueryText_TableName = "SELECT ALLOWED
		|	Obj.Ref,
		|	Obj.Ref.Company AS Company,
		|	Obj.Ref.Partner AS Partner,
		|	Obj.Ref.LegalName AS LegalName,
		|	Obj.Ref.Agreement AS Agreement,
		|	Obj.Ref.DocumentAmount AS DocumentAmount,
		|	Obj.Ref.Currency AS Currency
		|INTO Doc
		|FROM
		|	DocumentJournal.%1 AS Obj
		|WHERE
		|	True
		|	%2";
	
	QueryText_OpeningEntryTableName1 = "";
	If OpeningEntryTableName1 <> Undefined Then
		QueryText_OpeningEntryTableName1 = "
			|UNION ALL
			|SELECT
			|	OpeningEntry.Ref,
			|	MAX(OpeningEntry.Ref.Company),
			|	MAX(OpeningEntry.Partner),
			|	MAX(OpeningEntry.LegalName),
			|	MAX(OpeningEntry.Agreement),
			|	SUM(OpeningEntry.Amount),
			|	MAX(OpeningEntry.Currency)
			|FROM
			|Document.OpeningEntry.%1 AS OpeningEntry
			|	WHERE
			|	TRUE
			|	%2
			|GROUP BY
			|	OpeningEntry.Ref";
	EndIf;
	
	QueryText_OpeningEntryTableName2 = "";
	If OpeningEntryTableName2 <> Undefined Then
		QueryText_OpeningEntryTableName2 = "
			|UNION ALL
			|SELECT
			|	OpeningEntry.Ref,
			|	MAX(OpeningEntry.Ref.Company),
			|	MAX(OpeningEntry.Partner),
			|	MAX(OpeningEntry.LegalName),
			|	MAX(OpeningEntry.Agreement),
			|	SUM(OpeningEntry.Amount),
			|	MAX(OpeningEntry.Currency)
			|FROM
			|Document.OpeningEntry.%1 AS OpeningEntry
			|	WHERE
			|	TRUE
			|	%2
			|GROUP BY
			|	OpeningEntry.Ref";
	EndIf;
	
	QueryText_DebitNote = "";
	If DebitNoteTableName <> Undefined Then
		QueryText_DebitNote = "
		|UNION ALL
		|SELECT
		|	DebitNote.Ref,
		|	MAX(DebitNote.Ref.Company),
		|	MAX(DebitNote.Partner),
		|	MAX(DebitNote.LegalName),
		|	MAX(DebitNote.Agreement),
		|	SUM(DebitNote.Amount),
		|	MAX(DebitNote.Currency)
		|FROM
		|Document.DebitNote.%1 AS DebitNote
		|	WHERE
		|	TRUE
		|	%2
		|GROUP BY
		|	DebitNote.Ref";
	EndIf;
	
	QueryText_CreditNote = "";
	If CreditNoteTableName <> Undefined Then
		QueryText_CreditNote = "
		|UNION ALL
		|SELECT
		|	CreditNote.Ref,
		|	MAX(CreditNote.Ref.Company),
		|	MAX(CreditNote.Partner),
		|	MAX(CreditNote.LegalName),
		|	MAX(CreditNote.Agreement),
		|	SUM(CreditNote.Amount),
		|	MAX(CreditNote.Currency)
		|FROM
		|Document.CreditNote.%1 AS CreditNote
		|	WHERE
		|	TRUE
		|	%2
		|GROUP BY
		|	CreditNote.Ref";
	EndIf;
		
	QueryParameters = New Structure();
	QueryParameters.Insert("Ref", Ref);
	
	ArrayOfConditions = New Array();
	ArrayOfConditionsOpeningEntry = New Array();
	ArrayOfConditionsDebitNote = New Array();
	ArrayOfConditionsCreditNote = New Array();
	
	QueryParameters.Insert("ShowAll", False);
	
	If Parameters.Property("Type") Then
		QueryParameters.Insert("Type", Parameters.Type);
		ArrayOfConditions.Add(" AND Obj.Type = &Type");
	EndIf;
	
	If Parameters.Property("Unmarked") Then
		QueryParameters.Insert("Unmarked", Parameters.Unmarked);
		ArrayOfConditions.Add(" AND NOT Obj.DeletionMark = &Unmarked");
		ArrayOfConditionsOpeningEntry.Add(" AND NOT OpeningEntry.Ref.DeletionMark = &Unmarked");
		ArrayOfConditionsDebitNote.Add(" AND NOT DebitNote.Ref.DeletionMark = &Unmarked");
		ArrayOfConditionsCreditNote.Add(" AND NOT CreditNote.Ref.DeletionMark = &Unmarked");
	EndIf;
	
	If Parameters.Property("Partner") Then
		QueryParameters.Insert("Partner", Parameters.Partner);
		ArrayOfConditions.Add(" AND Obj.Ref.Partner = &Partner");
		ArrayOfConditionsOpeningEntry.Add(" AND OpeningEntry.Partner = &Partner");
		ArrayOfConditionsDebitNote.Add(" AND DebitNote.Partner = &Partner");
		ArrayOfConditionsCreditNote.Add(" AND CreditNote.Partner = &Partner");
	EndIf;
	
	If Parameters.Property("LegalName") Then
		QueryParameters.Insert("LegalName", Parameters.LegalName);
		ArrayOfConditions.Add(" AND Obj.Ref.LegalName = &LegalName");
		ArrayOfConditionsOpeningEntry.Add(" AND OpeningEntry.LegalName = &LegalName");
		ArrayOfConditionsDebitNote.Add(" AND DebitNote.LegalName = &LegalName");
		ArrayOfConditionsCreditNote.Add(" AND CreditNote.LegalName = &LegalName");
	EndIf;
	
	If Parameters.Property("Agreement") Then
		QueryParameters.Insert("Agreement", Parameters.Agreement);
		ArrayOfConditions.Add(" AND Obj.Ref.Agreement = &Agreement");
		ArrayOfConditionsOpeningEntry.Add(" AND OpeningEntry.Agreement = &Agreement");
		ArrayOfConditionsDebitNote.Add(" AND DebitNote.Agreement = &Agreement");
		ArrayOfConditionsCreditNote.Add(" AND CreditNote.Agreement = &Agreement");
	EndIf;
	
	If Parameters.Property("Company") Then
		QueryParameters.Insert("Company", Parameters.Company);
		ArrayOfConditions.Add(" AND Obj.Ref.Company = &Company");
		ArrayOfConditionsOpeningEntry.Add(" AND OpeningEntry.Ref.Company = &Company");
		ArrayOfConditionsDebitNote.Add(" AND DebitNote.Ref.Company = &Company");
		ArrayOfConditionsCreditNote.Add(" AND CreditNote.Ref.Company = &Company");
	EndIf;
	
	If Parameters.Property("Agreement_ApArPostingDetail") Then
		QueryParameters.Insert("Agreement_ApArPostingDetail", Parameters.Agreement_ApArPostingDetail);
		ArrayOfConditions.Add(" AND Obj.Ref.Agreement.ApArPostingDetail = &Agreement_ApArPostingDetail");
		ArrayOfConditionsOpeningEntry.Add(" AND OpeningEntry.Agreement.ApArPostingDetail = &Agreement_ApArPostingDetail");
		ArrayOfConditionsDebitNote.Add(" AND DebitNote.Agreement.ApArPostingDetail = &Agreement_ApArPostingDetail");
		ArrayOfConditionsCreditNote.Add(" AND CreditNote.Agreement.ApArPostingDetail = &Agreement_ApArPostingDetail");
	EndIf;
	
	If Parameters.Property("Posted") Then
		QueryParameters.Insert("Posted", Parameters.Posted);
		ArrayOfConditions.Add(" AND Obj.Ref.Posted = &Posted");
		ArrayOfConditionsOpeningEntry.Add(" AND OpeningEntry.Ref.Posted = &Posted");
		ArrayOfConditionsDebitNote.Add(" AND DebitNote.Ref.Posted = &Posted");
		ArrayOfConditionsCreditNote.Add(" AND CreditNote.Ref.Posted = &Posted");
	EndIf;
	
	ConditionsText             = StrConcat(ArrayOfConditions);
	ConditionsOpeningEntryText = StrConcat(ArrayOfConditionsOpeningEntry);
	ConditionsDebitNoteText    = StrConcat(ArrayOfConditionsDebitNote);
	ConditionsCreditNoteText   = StrConcat(ArrayOfConditionsCreditNote);
	
	QueryText_TableName = StrTemplate(QueryText_TableName, TableName, ConditionsText);
	
	If OpeningEntryTableName1 <> Undefined Then
		QueryText_OpeningEntryTableName1 = StrTemplate(QueryText_OpeningEntryTableName1, OpeningEntryTableName1, ConditionsOpeningEntryText);
	EndIf;

	If OpeningEntryTableName2 <> Undefined Then
		QueryText_OpeningEntryTableName2 = StrTemplate(QueryText_OpeningEntryTableName2, OpeningEntryTableName2, ConditionsOpeningEntryText);
	EndIf;
	
	If DebitNoteTableName <> Undefined Then
		QueryText_DebitNote = StrTemplate(QueryText_DebitNote, DebitNoteTableName, ConditionsDebitNoteText);
	EndIf;
	
	If CreditNoteTableName <> Undefined Then
		QueryText_CreditNote = StrTemplate(QueryText_CreditNote, CreditNoteTableName, ConditionsCreditNoteText);
	EndIf;
	
	QueryText = QueryText_TableName 
	+ QueryText_OpeningEntryTableName1 
	+ QueryText_OpeningEntryTableName2
	+ QueryText_DebitNote
	+ QueryText_CreditNote
	+ " ;

	|SELECT ALLOWED
	|	CustomersTransactions.Basis AS Ref,
	|	CustomersTransactions.Company AS Company,
	|	CustomersTransactions.Partner AS Partner,
	|	CustomersTransactions.LegalName AS LegalName,
	|	CustomersTransactions.Agreement AS Agreement,
	|	CustomersTransactions.Currency AS Currency,
	|	CustomersTransactions.AmountBalance AS DocumentAmount
	|INTO DocWithBalance
	|FROM
	|	AccumulationRegister.R2021B_CustomersTransactions.Balance(&Period,
	|		CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)
	|	AND (Basis, Company, Partner, LegalName, Agreement, Currency) IN
	|		(SELECT
	|			Doc.Ref,
	|			Doc.Company,
	|			Doc.Partner,
	|			Doc.LegalName,
	|			Doc.Agreement,
	|			Doc.Currency
	|		FROM
	|			Doc AS Doc)) AS CustomersTransactions
	|WHERE
	|	CustomersTransactions.AmountBalance > 0
	|
	|
	|
	|UNION ALL
	|
	|SELECT
	|	VendorsTransactions.Basis,
	|	VendorsTransactions.Company,
	|	VendorsTransactions.Partner,
	|	VendorsTransactions.LegalName,
	|	VendorsTransactions.Agreement,
	|	VendorsTransactions.Currency,
	|	VendorsTransactions.AmountBalance
	|FROM
	|	AccumulationRegister.R1021B_VendorsTransactions.Balance(&Period,
	|		CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)
	|	AND (Basis, Company, Partner, LegalName, Agreement, Currency) IN
	|		(SELECT
	|			Doc.Ref,
	|			Doc.Company,
	|			Doc.Partner,
	|			Doc.LegalName,
	|			Doc.Agreement,
	|			Doc.Currency
	|		FROM
	|			Doc AS Doc)) AS VendorsTransactions
	|WHERE
	|	VendorsTransactions.AmountBalance > 0
	|;
	|//////////////////////////////////////////////////////////////
	|SELECT 
	|	DocWithBalance.Ref,
	|	DocWithBalance.Company,
	|	DocWithBalance.Partner,
	|	DocWithBalance.LegalName,
	|	DocWithBalance.Agreement,
	|	DocWithBalance.Currency,
	|	DocWithBalance.DocumentAmount
	|INTO AllDoc
	|FROM DocWithBalance AS DocWithBalance
	|
	|UNION ALL
	|
	|SELECT
	|	Doc.Ref,
	|	Doc.Company,
	|	Doc.Partner,
	|	Doc.LegalName,
	|	Doc.Agreement,
	|	Doc.Currency,
	|	0
	|FROM Doc AS Doc
	|	WHERE &ShowAll
	|;
	|/////////////////////////////////////////////////////
	|SELECT
	|	AllDoc.Ref,
	|	AllDoc.Company,
	|	AllDoc.Partner,
	|	AllDoc.LegalName,
	|	AllDoc.Agreement,
	|	AllDoc.Currency,
	|	SUM(AllDoc.DocumentAmount) AS DocumentAmount
	|FROM AllDoc AS AllDoc
	|GROUP BY
	|	AllDoc.Ref,
	|	AllDoc.Company,
	|	AllDoc.Partner,
	|	AllDoc.LegalName,
	|	AllDoc.Agreement,
	|	AllDoc.Currency";
	
	FilterStructure = New Structure();
	FilterStructure.Insert("QueryText", QueryText);
	FilterStructure.Insert("QueryParameters", QueryParameters);
	
	Return FilterStructure;
EndFunction
